# SQL Select examples/exercise

Example dataset with three related tables:

* Students table: provides students personal/profile information
  - student_id (INTEGER, PRIMARY KEY): unique (internal) ID number
  - name (TEXT): name of the student
  - age (INTEGER): age of student
  - gender (TEXT): gender of student

* Courses table: contains information about the courses
  - course_id (INTEGER, PRIMARY KEY): unique (internal) course ID number
  - name (TEXT): Name of the course
  - instructor (TEXT): name of the instructor

* Enrollments table: provides information about which student is participating in which course
  - enrollment_id (INTEGER, PRIMARY KEY): unique key to the enrollment table
  - student_id (INTEGER, FOREIGN KEY): student ID
  - course_id (INTEGER, FOREIGN KEY): course ID
  - grade (TEXT): student's grade in the respective course

Some sample data to populate these tables:

* Students:

|student_id|name|age|gender|
|---|---|---|---|
|1|John Doe|20|Male|
|2|Jane Smith|22|Female|
|3|Bob Green|21|Male|
|4|Lisa Brown|19|Female|
|5|Tom Lee|23|Male|

* Courses:

|course_id|name|instructor|
|---|---|---|
|1|English 101|Mr. Smith|
|2|Math 101|Ms. Johnson|
|3|Science 101|Dr. Green|
|4|History 101|Ms. Brown|

* Enrollments:

|enrollment_id|student_id|course_id|grade
|---|---|---|---
|1|1|1|A
|2|1|2|B
|3|1|3|A
|4|2|1|B
|5|2|2|A
|6|2|4|C
|7|3|2|A
|8|3|3|A
|9|4|1|C
|10|4|3|B
|11|5|2|A
|12|5|4|D

## Access the database

The database tables represented above are provided in the SQLite file `example.db`.
We can read/query data from such database in many different ways: with any software supporting connecting to a SQLite database.

Python provides support for connecting to a SQLite database in its standard library, throught the [`sqlite3`](https://docs.python.org/3/library/sqlite3.html) module.

We can use Python's `sqlite3` module alone to do so (example below), but also make use of Pandas. The advantage of using Pandas to interact with the database is that the result arrives already as a Pandas Dataframe.

In [4]:
# The first step is to CONNECT to the database
#
import sqlite3

# Create a connection
conn = sqlite3.connect('example.db')

In [5]:
# Using SQLite only, we can simply execute the query

c = conn.execute('''SELECT * FROM students''')
c.fetchall()

[(1, 'John Doe', 20, 'Male'),
 (2, 'Jane Smith', 22, 'Female'),
 (3, 'Bob Green', 21, 'Male'),
 (4, 'Lisa Brown', 19, 'Female'),
 (5, 'Tom Lee', 23, 'Male')]

In [6]:
# With Pandas, besides the SQL statement, you pass the CONNECTION objection
#
import pandas

pandas.read_sql_query('''SELECT * FROM students''', conn)

   student_id        name  age  gender
0           1    John Doe   20    Male
1           2  Jane Smith   22  Female
2           3   Bob Green   21    Male
3           4  Lisa Brown   19  Female
4           5     Tom Lee   23    Male

In [9]:
# Let's see the counts of `courses` and `enrollments` tables
#
pandas.read_sql_query('''SELECT COUNT(*) FROM courses''', conn)

   COUNT(*)
0         4

In [10]:
conn.execute('''SELECT COUNT(*) FROM enrollments''').fetchall()

[(12,)]

## Examples

Execute the following examples and check their answers. After that, answer the questions below.

Select a specific student by ID:
```sql
SELECT * FROM students WHERE student_id = 1;
```
A table of the student with student_id = 1, including their name, age, and gender.

Select a specific course by ID:
```sql
SELECT * FROM courses WHERE course_id = 2;
```

Select all enrollments for a specific student:
```sql
SELECT * FROM enrollments WHERE student_id = 3;
```

Select all enrollments for a specific course:
```sql
SELECT * FROM enrollments WHERE course_id = 1;
```

Select the average grade for a specific course:
```sql
SELECT AVG(grade) FROM enrollments WHERE course_id = 1;
```

Select the number of students enrolled in a specific course:
```sql
SELECT COUNT(*) FROM enrollments WHERE course_id = 1;
```

Select the names of all male students:
```sql
SELECT name 
FROM students 
WHERE gender = 'Male';
```

Select the names and instructors of all courses taught by female instructors:
```sql
SELECT name, instructor 
FROM courses 
WHERE instructor IN 
    (SELECT DISTINCT instructor FROM courses WHERE gender = 'Female');
```

Select the average grade for each course:
```sql
SELECT course_id, AVG(grade) 
FROM enrollments 
GROUP BY course_id;
```

Select the names and average age of students grouped by gender, only for groups with more than one student:
```sql
SELECT gender, AVG(age) 
FROM students 
GROUP BY gender 
HAVING COUNT(*) > 1;
```

Select the names and ages of students in descending order of age:
```sql
SELECT name, age 
FROM students ORDER BY age DESC;
```

Select the names of students and the courses they are enrolled in:
```sql
SELECT students.name, courses.name 
FROM students 
JOIN enrollments ON students.student_id = enrollments.student_id 
JOIN courses ON enrollments.course_id = courses.course_id;
```

## Exercises

Answer the following questions using SQL SELECT code similar to the ones above.

1. Write an SQL query to find the names and ages of all female students.
2. Write an SQL query to find the names of all courses taught by female instructors.
3. Write an SQL query to find the name and grade of the student with student_id = 2.
4. Write an SQL query to find the average age of male students.
5. Write an SQL query to find the names and ages of the three youngest students.
6. Write an SQL query to find the names of students who are enrolled in more than two courses.
7. Write an SQL query to find the names of courses and their average grade, sorted in descending order of average grade.
8. Write an SQL query to find the names of students and the names of courses they are enrolled in, sorted by student name.
9. Write an SQL query to find the number of male and female students.
10. Write an SQL query to find the names of students who are enrolled in both English 101 and Math 101 courses.